Repository: fruch/django-subcenter
Catalog: sub/shows/locale/*/LC_MESSAGES/django.po
Languages: he

source: English
he: אנגלית

source: Hebrew
he: עברית

source: Show Details
he: הצג פרטים

source: Your tags are shared
he: התגים שלך משותפים

source: title can't be empty
he: כותרת לא יכול להיות ריקה

source: %s already exists
he: %s כבר קיים

source: The title
he: כותרת

source: The summary
he: סיכום

source: Poster
he: פוסטר

source: Genre
he: ז'אנר

source: Cast
he: צוות

source: Running Years
he: שנים

source: IMDB id
he: הורדת id

source: Tags
he: תגיות

source: Belongs to
he: שייך

source: Season Number
he: פרק מספר

source: Episode Number
he: עונה מספר

source: Season
he: עונה

source: Episode
he: פרק

source: Edit
he: ערוך

source: Episodes Guide
he: מדריך פרקים

source: Add/Edit Movie Details
he: הוספה / עריכה של פרטי הסרט

source: Populate Episodes
he: אכלס פרקים

source: Loading data from IMDB
he: טעינת נתונים מ IMDB

source: Save
he: שמור

source: TV Shows List
he: רשימת סדרות

source: Are you sure?
he: האם אתה בטוח?

source: yes
he: כן

source: no
he: לא

source: List of all Shows tagged
he: רשימת כל הסדרות המתוייגות ב

source: List of all Shows
he: רשימת כל הסדרות

source: Add Show
he: הוסף סידרה

source: Delete
he: למחוק
